-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2023 年 3 月 15 日 07:36
-- サーバのバージョン： 8.0.32
-- PHP のバージョン: 8.1.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `reservation_db`
--

DELIMITER $$
--
-- プロシージャ
--
CREATE DEFINER=`root`@`localhost` PROCEDURE `AUTO_RESERVATION` (IN `IN_DATE` DATE, OUT `OUT_MESSAGES` VARCHAR(255))   BEGIN
  -- 変数定義
  DECLARE ROW_COUNT    INT;           -- 処理件数
  DECLARE OUT_MESSAGE  VARCHAR(255);  -- 完了メッセージ
  
  DECLARE _not_found tinyint UNSIGNED DEFAULT 0;
  DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
      GET DIAGNOSTICS CONDITION 1 @sqlstate = RETURNED_SQLSTATE, @errno = MYSQL_ERRNO, @text = MESSAGE_TEXT;
      SELECT @sqlstate, @errno, @text;
      ROLLBACK;
    END;
  
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET _not_found = 1;
  
  DECLARE CONTINUE HANDLER FOR SQLWARNING
    BEGIN
      GET DIAGNOSTICS CONDITION 1 @sqlstate = RETURNED_SQLSTATE, @errno = MYSQL_ERRNO, @text = MESSAGE_TEXT;
    END;
    
  BEGIN  
    START TRANSACTION;

    -- 指定日の登録
    REPLACE INTO `reservations` (`domain_organization`, `mode_reserve`, `date_reservation`, `email_staff`,`created_at`)
      SELECT `o`.`domain_organization`, `o`.`mode_reserve`, `IN_DATE`, `u`.`email`, CURRENT_DATE
      FROM `organizations` `o` INNER JOIN `users` `u` ON
          `o`.`domain_organization` = `u`.`domain_organization`
      AND `o`.`mode_reserve`        = `u`.`mode_reserve`
      AND `o`.`flag_delete`         = `u`.`flag_delete`
      WHERE `o`.`mode_reserve` = 1
      AND   `o`.`flag_delete` = 0
    ;

    -- 処理件数（REPLACEのため、削除件数も含まれる）
    SELECT ROW_COUNT() INTO OUT_MESSAGE;

    -- 実際の件数
    SELECT COUNT(*) INTO ROW_COUNT
    FROM `organizations` `o` INNER JOIN `users` `u` ON
          `o`.`domain_organization` = `u`.`domain_organization`
      AND `o`.`mode_reserve`        = `u`.`mode_reserve`
      AND `o`.`flag_delete`         = `u`.`flag_delete`
      WHERE `o`.`mode_reserve` = 1
      AND   `o`.`flag_delete` = 0
    ;

    -- コミット
    COMMIT;
    -- 完了メッセージ
    SELECT CONCAT(DATE_FORMAT(`IN_DATE`, '%Y-%m-%d'), ' : [', ROW_COUNT, '] 件挿入 / [', OUT_MESSAGE, '] 件処理しました。') INTO OUT_MESSAGES;
  END;
END$$

CREATE DEFINER=`root`@`localhost` PROCEDURE `EDIT_RESERVATION` (IN `IN_MODE` INT, IN `IN_DOMAIN` VARCHAR(255), IN `IN_MODE_RESERVE` INT, IN `IN_DATE` DATE, IN `IN_EMAIL` VARCHAR(255), OUT `OUT_MESSAGES` VARCHAR(255))   BEGIN
  -- 変数定義
  DECLARE ROW_COUNT    INT;           -- 処理件数
  DECLARE RSV_COUNT    INT;           -- 予約済件数
  DECLARE MAX_COUNT    INT;           -- 予約上限数
  DECLARE OUT_MESSAGE  VARCHAR(255);  -- 完了メッセージ
  
  DECLARE _not_found tinyint UNSIGNED DEFAULT 0;
  DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
      GET DIAGNOSTICS CONDITION 1 @sqlstate = RETURNED_SQLSTATE, @errno = MYSQL_ERRNO, @text = MESSAGE_TEXT;
      SELECT @sqlstate, @errno, @text;
      ROLLBACK;
    END;
  
  DECLARE CONTINUE HANDLER FOR NOT FOUND SET _not_found = 1;
  
  DECLARE CONTINUE HANDLER FOR SQLWARNING
    BEGIN
      GET DIAGNOSTICS CONDITION 1 @sqlstate = RETURNED_SQLSTATE, @errno = MYSQL_ERRNO, @text = MESSAGE_TEXT;
    END;
    
  BEGIN  
    START TRANSACTION;

    IF IN_MODE = 0 THEN
      -- １．DELの場合は、空振りOKで削除
      DELETE FROM `reservations` WHERE `domain_organization` = IN_DOMAIN AND `mode_reserve` = IN_MODE_RESERVE AND `date_reservation` = IN_DATE AND `email_staff` = IN_EMAIL;
      SET OUT_MESSAGE = '予約取消が完了しました。';

    ELSE
      -- INSの場合は条件アリ
      -- １．Organizationマスタから予約上限数を取得
     SELECT `count_license` INTO MAX_COUNT FROM `organizations` WHERE `domain_organization` = IN_DOMAIN AND `mode_reserve` = IN_MODE_RESERVE;



      -- ２．全体の予約件数
      SELECT COUNT(*) INTO RSV_COUNT  FROM `reservations` WHERE `domain_organization` = IN_DOMAIN AND `mode_reserve` = IN_MODE_RESERVE AND `date_reservation` = IN_DATE;
      -- ３．予約判定
      IF RSV_COUNT < MAX_COUNT THEN
        -- ３－１．予約上限に満たない場合は、REPLACEでデータ追加（重複の場合は削除＆追加）
        REPLACE INTO `reservations` (`domain_organization`, `mode_reserve`, `date_reservation`, `email_staff`, `created_at`, `updated_at`)
        VALUES (IN_DOMAIN, IN_MODE_RESERVE, IN_DATE, IN_EMAIL, CURRENT_DATE(), NOW());
        SET OUT_MESSAGE = '予約登録が完了しました。';
      ELSE
        -- ３－２．予約上限を超えている場合は、ROLLBACKして終了
        SET OUT_MESSAGE = '予約上限数を超えたため、予約登録できません。';
        ROLLBACK;
      END IF;
    END IF;
    -- コミット
    COMMIT;
    -- 完了メッセージ
    select OUT_MESSAGE INTO OUT_MESSAGES;
    -- sample 
    --  select OUT_MESSAGE INTO OUT_MESSAGES,@text INTO TEXT;
--      SELECT @sqlstate, @errno, @text, OUT_MESSAGE AS MSG_RESULT;
  END;
END$$

DELIMITER ;

-- --------------------------------------------------------

--
-- テーブルの構造 `auth_histories`
--

CREATE TABLE `auth_histories` (
  `id` bigint UNSIGNED NOT NULL,
  `user_id` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `ip_address` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `info` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT 'アクション',
  `user_agent` text COLLATE utf8mb4_bin,
  `login_time` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `auth_histories`
--

INSERT INTO `auth_histories` (`id`, `user_id`, `email`, `ip_address`, `info`, `user_agent`, `login_time`, `created_at`, `updated_at`) VALUES
(1, '3', 'user@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 06:45:35', '2023-03-15 06:45:35', '2023-03-15 06:45:35'),
(2, '3', 'user@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 06:54:01', '2023-03-15 06:54:01', '2023-03-15 06:54:01'),
(3, '3', 'user@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:02:15', '2023-03-15 07:02:15', '2023-03-15 07:02:15'),
(4, '3', 'user@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:09:19', '2023-03-15 07:09:19', '2023-03-15 07:09:19'),
(5, '3', 'user@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:12:02', '2023-03-15 07:12:02', '2023-03-15 07:12:02'),
(6, '1', 'super@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:12:28', '2023-03-15 07:12:28', '2023-03-15 07:12:28'),
(7, '1', 'super@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:14:34', '2023-03-15 07:14:34', '2023-03-15 07:14:34'),
(8, '1', 'super@marumaru.co.jp', NULL, 'logout', NULL, NULL, '2023-03-15 07:14:36', '2023-03-15 07:14:36'),
(9, '1', 'super@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:15:44', '2023-03-15 07:15:44', '2023-03-15 07:15:44'),
(10, '1', 'super@marumaru.co.jp', '10.0.2.2', 'logout', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', NULL, '2023-03-15 07:15:46', '2023-03-15 07:15:46'),
(11, '1', 'super@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:28:39', '2023-03-15 07:28:39', '2023-03-15 07:28:39'),
(12, '1', 'super@marumaru.co.jp', '10.0.2.2', 'login', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', '2023-03-15 07:32:28', '2023-03-15 07:32:28', '2023-03-15 07:32:28'),
(13, '1', 'super@marumaru.co.jp', '10.0.2.2', 'logout', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.69', NULL, '2023-03-15 07:32:31', '2023-03-15 07:32:31');

-- --------------------------------------------------------

--
-- テーブルの構造 `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `connection` text COLLATE utf8mb4_bin NOT NULL,
  `queue` text COLLATE utf8mb4_bin NOT NULL,
  `payload` longtext COLLATE utf8mb4_bin NOT NULL,
  `exception` longtext COLLATE utf8mb4_bin NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- --------------------------------------------------------

--
-- テーブルの構造 `holidays`
--

CREATE TABLE `holidays` (
  `id` bigint UNSIGNED NOT NULL,
  `date_holiday` date NOT NULL COMMENT '祝日',
  `name_holiday` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '祝日名',
  `flag_delete` int NOT NULL DEFAULT '0' COMMENT '削除フラグ（0:アクティブ/1:削除）',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `holidays`
--

INSERT INTO `holidays` (`id`, `date_holiday`, `name_holiday`, `flag_delete`, `created_at`, `updated_at`) VALUES
(1, '2023-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(2, '2023-01-02', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(3, '2023-01-09', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(4, '2023-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(5, '2023-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(6, '2023-03-21', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(7, '2023-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(8, '2023-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(9, '2023-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(10, '2023-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(11, '2023-07-17', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(12, '2023-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(13, '2023-09-18', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(14, '2023-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(15, '2023-10-09', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(16, '2023-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(17, '2023-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(18, '2024-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(19, '2024-01-08', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(20, '2024-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(21, '2024-02-12', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(22, '2024-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(23, '2024-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(24, '2024-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(25, '2024-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(26, '2024-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(27, '2024-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(28, '2024-05-06', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(29, '2024-07-15', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(30, '2024-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(31, '2024-08-12', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(32, '2024-09-16', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(33, '2024-09-22', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(34, '2024-09-23', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(35, '2024-10-14', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(36, '2024-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(37, '2024-11-04', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(38, '2024-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(39, '2025-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(40, '2025-01-13', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(41, '2025-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(42, '2025-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(43, '2025-02-24', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(44, '2025-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(45, '2025-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(46, '2025-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(47, '2025-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(48, '2025-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(49, '2025-05-06', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(50, '2025-07-21', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(51, '2025-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(52, '2025-09-15', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(53, '2025-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(54, '2025-10-13', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(55, '2025-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(56, '2025-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(57, '2025-11-24', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(58, '2026-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(59, '2026-01-12', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(60, '2026-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(61, '2026-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(62, '2026-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(63, '2026-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(64, '2026-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(65, '2026-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(66, '2026-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(67, '2026-05-06', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(68, '2026-07-20', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(69, '2026-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(70, '2026-09-21', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(71, '2026-09-22', '国民の休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(72, '2026-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(73, '2026-10-12', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(74, '2026-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(75, '2026-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(76, '2027-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(77, '2027-01-11', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(78, '2027-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(79, '2027-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(80, '2027-03-21', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(81, '2027-03-22', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(82, '2027-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(83, '2027-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(84, '2027-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(85, '2027-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(86, '2027-07-19', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(87, '2027-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(88, '2027-09-20', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(89, '2027-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(90, '2027-10-11', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(91, '2027-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(92, '2027-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(93, '2028-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(94, '2028-01-10', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(95, '2028-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(96, '2028-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(97, '2028-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(98, '2028-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(99, '2028-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(100, '2028-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(101, '2028-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(102, '2028-07-17', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(103, '2028-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(104, '2028-09-18', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(105, '2028-09-22', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(106, '2028-10-09', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(107, '2028-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(108, '2028-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(109, '2029-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(110, '2029-01-08', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(111, '2029-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(112, '2029-02-12', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(113, '2029-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(114, '2029-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(115, '2029-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(116, '2029-04-30', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(117, '2029-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(118, '2029-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(119, '2029-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(120, '2029-07-16', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(121, '2029-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(122, '2029-09-17', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(123, '2029-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(124, '2029-09-24', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(125, '2029-10-08', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(126, '2029-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(127, '2029-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(128, '2030-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(129, '2030-01-14', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(130, '2030-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(131, '2030-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(132, '2030-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(133, '2030-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(134, '2030-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(135, '2030-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(136, '2030-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(137, '2030-05-06', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(138, '2030-07-15', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(139, '2030-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(140, '2030-08-12', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(141, '2030-09-16', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(142, '2030-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(143, '2030-10-14', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(144, '2030-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(145, '2030-11-04', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(146, '2030-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(147, '2031-01-01', '元日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(148, '2031-01-13', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(149, '2031-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(150, '2031-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(151, '2031-02-24', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(152, '2031-03-21', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(153, '2031-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(154, '2031-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(155, '2031-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(156, '2031-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(157, '2031-05-06', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(158, '2031-07-21', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(159, '2031-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(160, '2031-09-15', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(161, '2031-09-23', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(162, '2031-10-13', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(163, '2031-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(164, '2031-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(165, '2031-11-24', '振替休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(166, '2032-01-12', '成人の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(167, '2032-02-11', '建国記念の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(168, '2032-02-23', '天皇誕生日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(169, '2032-03-20', '春分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(170, '2032-04-29', '昭和の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(171, '2032-05-03', '憲法記念日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(172, '2032-05-04', 'みどりの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(173, '2032-05-05', 'こどもの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(174, '2032-07-19', '海の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(175, '2032-08-11', '山の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(176, '2032-09-20', '敬老の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(177, '2032-09-21', '国民の休日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(178, '2032-09-22', '秋分の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(179, '2032-10-11', 'スポーツの日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(180, '2032-11-03', '文化の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35'),
(181, '2032-11-23', '勤労感謝の日', 0, '2023-01-23 04:47:35', '2023-01-23 04:47:35');

-- --------------------------------------------------------

--
-- テーブルの構造 `log`
--

CREATE TABLE `log` (
  `id` bigint UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- --------------------------------------------------------

--
-- テーブルの構造 `migrations`
--

CREATE TABLE `migrations` (
  `id` int UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `batch` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2022_09_08_130747_create_reservations_table', 1),
(6, '2022_09_08_130822_create_notifications_table', 1),
(7, '2022_11_16_160825_create_log_table', 1),
(8, '2022_11_18_091451_create_organization_table', 1),
(9, '2022_12_08_133052_create_holidays_table', 1),
(11, '2023_03_03_103201_create_auth_histories_table', 2);

-- --------------------------------------------------------

--
-- テーブルの構造 `notifications`
--

CREATE TABLE `notifications` (
  `id` bigint UNSIGNED NOT NULL,
  `flag_display` int NOT NULL COMMENT '全体周知系',
  `domain_organization` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT '自治体ドメイン',
  `mode_reserve` int NOT NULL DEFAULT '0' COMMENT 'アカウントフラグ（0:通常/1:常時）',
  `date_post` date NOT NULL COMMENT '投稿日時',
  `text_title` text COLLATE utf8mb4_bin NOT NULL COMMENT '投稿タイトル',
  `text_message` text COLLATE utf8mb4_bin NOT NULL COMMENT '投稿メッセージ',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `notifications`
--

INSERT INTO `notifications` (`id`, `flag_display`, `domain_organization`, `mode_reserve`, `date_post`, `text_title`, `text_message`, `created_at`, `updated_at`) VALUES
(37, 1, 'marumaru.co.jp', 0, '2023-01-31', 'Err', 'メンテナンス作業の為終日ご使用いただけません', '2023-01-23 05:03:51', '2023-01-23 05:03:51'),
(38, 0, 'marumaru.co.jp', 0, '2023-01-31', 'Err', 'メンテナンス作業の為終日ご使用いただけません', '2023-01-23 05:03:51', '2023-01-23 05:03:51'),
(39, 1, 'marumaru.co.jp', 0, '2023-02-28', 'Info', 'aaa', '2023-02-27 00:17:36', '2023-02-27 00:17:36');

-- --------------------------------------------------------

--
-- テーブルの構造 `organizations`
--

CREATE TABLE `organizations` (
  `id` bigint UNSIGNED NOT NULL,
  `domain_organization` varchar(30) COLLATE utf8mb4_bin NOT NULL COMMENT '自治体ドメイン名',
  `mode_reserve` int NOT NULL DEFAULT '0' COMMENT 'アカウントフラグ（0:通常/1:常時）',
  `name_organization` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT '自治体名',
  `stored_server` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT 'SplashTop対象サーバー名',
  `count_license` int NOT NULL DEFAULT '0' COMMENT '所持ライセンス',
  `date_maintenance` date NOT NULL COMMENT 'メンテナンス',
  `flag_license` int NOT NULL DEFAULT '0' COMMENT '契約形態（0:一般/1:個別）',
  `flag_delete` int NOT NULL DEFAULT '0' COMMENT '削除フラグ（0:アクティブ/1:削除）',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `organizations`
--

INSERT INTO `organizations` (`id`, `domain_organization`, `mode_reserve`, `name_organization`, `stored_server`, `count_license`, `date_maintenance`, `flag_license`, `flag_delete`, `created_at`, `updated_at`) VALUES
(1, 'marumaru.co.jp', 0, 'まるまる市', 'server1', 10, '2029-12-31', 0, 0, NULL, NULL),
(2, 'test1.co.jp', 0, 'test1市', 'server1', 10, '2029-12-31', 0, 0, NULL, NULL),
(3, 'test2.co.jp', 0, 'test2市', 'server3', 10, '2029-12-31', 0, 0, NULL, NULL),
(4, 'marumaru.co.jp', 1, 'まるまる市（常時）', 'server1', 10, '2029-12-31', 0, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- --------------------------------------------------------

--
-- テーブルの構造 `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `tokenable_id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_bin NOT NULL,
  `abilities` text COLLATE utf8mb4_bin,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `personal_access_tokens`
--

INSERT INTO `personal_access_tokens` (`id`, `tokenable_type`, `tokenable_id`, `name`, `token`, `abilities`, `last_used_at`, `expires_at`, `created_at`, `updated_at`) VALUES
(56, 'App\\Models\\User', 1, 'test', '7d95343a34895f2e11499e4ca5c2f06ab886b52085f0bf21a2b1b635dc294a28', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(57, 'App\\Models\\User', 1, 'test', '79b473c09f1755a68ec29c52a89134acce47ed5042dd8fdd5616c99c72bdfab4', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(58, 'App\\Models\\User', 1, 'test', '9a83165d1e58b7c01db4bcc5362c660162faea7bdcf56173b4b8f21cf9b74ac4', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(59, 'App\\Models\\User', 1, 'test', 'c63b0ff5a130cdf5d83f2aed7bc17fe4b1b94e137ed11d8c87ef9e73ca03bf25', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(60, 'App\\Models\\User', 1, 'test', 'ef318a5562e20eade76f214d98c3a60629ccf17fee12930287bcf8825ede562e', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(61, 'App\\Models\\User', 1, 'test', 'b286c59d1a1191a4bee31c46cf7a10b3f70e806a8d13c816d8a969db95a121fb', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(62, 'App\\Models\\User', 1, 'test', '823f0514ed9cdac2a6cd23016f6b32937a21a8a4337a2e5dce905061ec431c5d', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(63, 'App\\Models\\User', 1, 'test', 'b807915b69cf28d83a89ed360ab39618012e2c932fb6e562e4ef343e2f06364f', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(64, 'App\\Models\\User', 1, 'test', '837b26f7769d2c9db7202c6af047c0408d3263074e2ae40d56344b97529a568f', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(65, 'App\\Models\\User', 1, 'test', '520945deead4736d15bad16434e9a24acc05c71fd5e0f6a6af9ec771802295f5', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:10', '2023-02-27 06:55:10'),
(66, 'App\\Models\\User', 1, 'test', 'dc1904c5f32104f034272e96c7ef459bbb6b127a93a6e5eed8f797903e831afa', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(67, 'App\\Models\\User', 1, 'test', '4274b98a79964f61dd2b06d5f462242bc8685d2175ad6b0d2413090a98b8e919', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(68, 'App\\Models\\User', 1, 'test', 'df0983ea3a7c6ff1ad186910f4b86a63fd9a62c522d6b94a3b568c1260419999', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(69, 'App\\Models\\User', 1, 'test', '0af4f095712f532dc3734b059f3a00fde694efad78705a721bffa22bfbf9a318', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(70, 'App\\Models\\User', 1, 'test', 'b1122e0058123a4f842790394e00497418e7c7d436dadd6a8dbf52816531c224', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(71, 'App\\Models\\User', 1, 'test', '2e16148c0c72ea8f0113ea12182172698befa03cb23f1f4c7979a14276c7a7d7', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(72, 'App\\Models\\User', 1, 'test', '29eb0a8089bb97af3972838e2aa341356dbea22035c31ab0a9e41688322af1e8', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:11', '2023-02-27 06:55:11'),
(73, 'App\\Models\\User', 1, 'test', 'fdf76145de4ca2d403c0c9ea9aefc19f048a2d0d503c66f189933c0a7fe6250f', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(74, 'App\\Models\\User', 1, 'test', '3fed1a5c3448f823133b059612270a93e2a316614c929bb12957221401ef3411', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(76, 'App\\Models\\User', 1, 'test', 'f7e48323e807e5e2c0b6f9b66e4d6204a8d4ae2d8d9d76672007f4e3779fc285', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(77, 'App\\Models\\User', 1, 'test', 'e4734210770714523bdcaf2f97359285603431cd6fcb93656430a9ebc07f63a1', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(78, 'App\\Models\\User', 1, 'test', '3b911ac78560c0715d76c1cca2163b8d81c3a8ee958f94e802cad254d02fc363', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(79, 'App\\Models\\User', 1, 'test', '9d47da7f6a7aa02898bae00ccb0d4341d9790465728260a29c01bebadfee38a6', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(80, 'App\\Models\\User', 1, 'test', 'fce6a84a1b2c7e95f9a0e4d8c062a818bfab1e4c7bef354f249a838bcceea331', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(81, 'App\\Models\\User', 1, 'test', '4d122fa80f0a4d2349380599acf53e8064e3b1d400649b2b8dbdea1db0e58d44', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(82, 'App\\Models\\User', 1, 'test', 'da641b0560d6d7b1d0289e37cbff2fde9a2500f6af03ffbcdee524de27ebf5db', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(83, 'App\\Models\\User', 1, 'test', '819e592630f9fb51d74507fd23ea3f280678f51067f0267f4648eddba5dcb588', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(84, 'App\\Models\\User', 1, 'test', '34c67fde230b01fab2c5298adb62088f6cc61e7dde35e33c102ea864d464e21b', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(85, 'App\\Models\\User', 1, 'test', 'c516746da291b75cd6a242aada753dd53732f9d6f1c5f8d3e26435211a0ca188', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(86, 'App\\Models\\User', 1, 'test', 'd63735dc43312311d150ded2d818ec71a68e0d4190fdaa2c157f22ff65e7c022', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(87, 'App\\Models\\User', 1, 'test', '43566d7b9ccb95f707148816d130d6dbe829df5ddbfd7ce75d2a5d2890aa8ed0', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(88, 'App\\Models\\User', 1, 'test', '88c3672a7caff409ff2d38bfb15d221a146b7ba2f2c5d634fe1aa927ea2b76f7', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(89, 'App\\Models\\User', 1, 'test', 'ccd5af75de8c1762e863ed5db53d356b7a5e64023425cb3495340513d1dfa336', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(90, 'App\\Models\\User', 1, 'test', 'e73822ed668b6eedf8dd52925f9485f76f30c468d5ddacb9a799541e34874339', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:12', '2023-02-27 06:55:12'),
(91, 'App\\Models\\User', 1, 'test', '943faf7b4388ca97ca9166f61f8ad366d33c54d8f2951222a3b2e85ac6b9edb5', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:13', '2023-02-27 06:55:13'),
(92, 'App\\Models\\User', 1, 'test', '302b10e3f8181d86a312cb709cd813f302b7e46581a7eda9f10c445fbb3447e9', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:13', '2023-02-27 06:55:13'),
(93, 'App\\Models\\User', 1, 'test', 'a109b98871e4161c801e489e5fde29b2a325e02543607174e0cb774bda72a5d9', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(94, 'App\\Models\\User', 1, 'test', 'ef7c1073ed6ef3fbccb3bd356a032e78f773cfa3da550990ca1e6742f89d7088', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(95, 'App\\Models\\User', 1, 'test', 'd7823b8951689af2ab590855c4ce7cfe53346c51d00745bac7451567a9dda856', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(96, 'App\\Models\\User', 1, 'test', '34ba82947f561685211bf091df05aca5693dc2ddaa5f086760cf1a30a8129b56', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(97, 'App\\Models\\User', 1, 'test', 'f338721da799fab83371887ebebcb0ff477ee59943342026dc964f62ff79b48f', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(98, 'App\\Models\\User', 1, 'test', 'dcd24ce0a79e1b0ab4c8ce75a7df7090609e9a94bf20aaaf56dc8e07ef15e001', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(99, 'App\\Models\\User', 1, 'test', '9f2d08cb197e5a7e029e83192383c569de721a266ec49fc7a20025dd82f238f6', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(100, 'App\\Models\\User', 1, 'test', 'bc5ec2223c3a032f008b1a3be1a463bc1a3fa8a8d578f241344b1bf008d50aa9', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(101, 'App\\Models\\User', 1, 'test', '864d8ca58570b02ef1ed55516aea3a3a5d254b8b5dd0de73a2ca2f51fac66e8e', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(102, 'App\\Models\\User', 1, 'test', 'fdfa3db3647d613324d5465b1da6227817a0a23b33d552508de7c421da9f3765', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(103, 'App\\Models\\User', 1, 'test', 'bf367ea113c27d14e5b120b52fb77b15326d8c1ec3595426f0ba27fb7e978690', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(104, 'App\\Models\\User', 1, 'test', 'c6f9f523a798c743f44df46ac4587de2a06eba37d347702c105784de6b8f0097', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:18', '2023-02-27 06:55:18'),
(105, 'App\\Models\\User', 1, 'test', '7ef2bb059ab23c726bbc0eba7079dd5bbe82c4c05e84db234ce78169da2610ae', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(106, 'App\\Models\\User', 1, 'test', '6a3ade9912dd8778b9a951335794a95d0385314daafbc7a2d4dc918d1c29c877', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(107, 'App\\Models\\User', 1, 'test', '0d965922d0fa6f0ec5c855797297d32ad700a7c99fb89ae3d7e667947c4d2ace', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(108, 'App\\Models\\User', 1, 'test', 'ecc6d03b2cf630bf586126ac7732142c9af6fbaa0ea3ef73946717c180edf053', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(109, 'App\\Models\\User', 1, 'test', '3819bebb4c47c773f4efaecab55e334081c6a1cbd9ef1998389e63f0aafb8297', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(110, 'App\\Models\\User', 1, 'test', '176bd1cb949bcaf802c9b5a3a33ba445e0d08b4e54b42697955a9f0682116394', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(111, 'App\\Models\\User', 1, 'test', '9339941f347a23309310f61e2a586ea0641abdf3021bfffec1faa0a34e337a80', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(112, 'App\\Models\\User', 1, 'test', '09eecfabffd2a39af5d110e0ce75f5106301d36419eea4bd50eeabecbc81df94', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:19', '2023-02-27 06:55:19'),
(113, 'App\\Models\\User', 1, 'test', '339ba21725672076cd9a8ffb07b27fbef4370b580286b29584c172a9215c7bd6', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:49', '2023-02-27 06:55:49'),
(114, 'App\\Models\\User', 1, 'test', '3b2d8b63cdaa0cd190ba94a9582cbeb3ff5d47aefafad93e86a7b06f698c08bb', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:49', '2023-02-27 06:55:49'),
(115, 'App\\Models\\User', 1, 'test', '4c5e1b6f149970d765563044998a4576a0d383ded299d7524de1c490740b90ed', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(116, 'App\\Models\\User', 1, 'test', '529ec05e23b6b74269bfc11d505e9a9adda81262302c5010897a4ce0130c375e', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(117, 'App\\Models\\User', 1, 'test', 'cfb05fbd9be8490332b65cf20a148b2795ad7516d3da05675064b508d2f372ac', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(118, 'App\\Models\\User', 1, 'test', '1eb377bca8cbc1696eaa6b9059957d6dd6927db65ac24ee6d38e3a1cd79b4537', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(119, 'App\\Models\\User', 1, 'test', 'a3255e459b142a5d387a34cdfec14e5f9f2bf74fd1f9ae070e5e6f5c8142eadd', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(120, 'App\\Models\\User', 1, 'test', '20e538933414ce6c949d943324a32285643950502a163da7d0269067b20d8cdd', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(121, 'App\\Models\\User', 1, 'test', '9eb75d1ce57ee0b25402c9c1a7e2ee2417ca8efab3872ec2ffba322ffedfe8ac', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(122, 'App\\Models\\User', 1, 'test', '4723cd93af44ef12d84d4de41d7a227efedf82799747ddfa6a3df010494c3ad9', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(123, 'App\\Models\\User', 1, 'test', 'be0109e41fec5643a42692fceedd0b079b29bce792df868dcc0f6127cb221c5d', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(124, 'App\\Models\\User', 1, 'test', 'f11252d18e40db8bcf4e78a84a9382bee083df17b18750c87f3a91edfeab8c09', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(125, 'App\\Models\\User', 1, 'test', 'ac55992081a8f463923d4372c96d47166eec6e2e98cc1c75dc9da8c8b7710de4', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(126, 'App\\Models\\User', 1, 'test', '935a3d3968d42591f78268879a70839ec6085e2f82e18c88fdf6f393c9e9b00d', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(127, 'App\\Models\\User', 1, 'test', '6eb3b6da55cdda3be01c300b3d14bd69e4e9a01ba02d3c39b46fba1c2eec2d5e', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(128, 'App\\Models\\User', 1, 'test', '6e0950b2830e2ff7453dca2b4f8466fbde6f6855124a4141a8da53d046227492', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(129, 'App\\Models\\User', 1, 'test', '0a26c719fba25f0519a5ff0714c1ddff0a28b1d66aa53b3469374f0e3c3d10ac', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(130, 'App\\Models\\User', 1, 'test', '892ce252702b8a23d8834bae4f4648ffe9c0e81f087530d9b70d0d359a046c48', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(131, 'App\\Models\\User', 1, 'test', '6c24e5d08ffad47d8c85fb512594cbe13edf57cf5aee02e60fcc7a0929a550a1', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(132, 'App\\Models\\User', 1, 'test', '03d5fb4af6fcd98463f19cfb20499fb80e50eaea4b4a93e8e027623c6e168ca9', '[\"*\"]', NULL, NULL, '2023-02-27 06:55:50', '2023-02-27 06:55:50'),
(133, 'App\\Models\\User', 1, 'ResetAPI', '36ce2924c861483ae9017cfc17cfa933face8cc59faea2ec48f41226eba5eb0c', '[\"*\"]', NULL, NULL, '2023-02-28 02:02:45', '2023-02-28 02:02:45'),
(134, 'App\\Models\\User', 1, 'test', '80573a6155f94cc434f0f4d1acfc3b5940137c1714167414425a63da35306798', '[\"*\"]', NULL, NULL, '2023-02-28 02:18:48', '2023-02-28 02:18:48'),
(135, 'App\\Models\\User', 1, 'ResetAPI', 'b9606571abbf9a2fe38fa0d7b8cce9fbc464f1ce6ba24c1fe1f26003baf5d7c7', '[\"*\"]', NULL, NULL, '2023-02-28 02:23:35', '2023-02-28 02:23:35'),
(136, 'App\\Models\\User', 1, 'ResetAPI', 'fba741385c3c5b5a7593cb838879d4e20bdf3d86714c1a601101f222666010ee', '[\"*\"]', NULL, NULL, '2023-02-28 02:24:18', '2023-02-28 02:24:18'),
(137, 'App\\Models\\User', 1, 'ResetAPI', 'd5ba5fdcf9f526ad1bbb54b2968c59fabeb252a37dd32c71f5181d001f930339', '[\"*\"]', NULL, NULL, '2023-02-28 02:24:22', '2023-02-28 02:24:22'),
(138, 'App\\Models\\User', 1, 'ResetAPI', '91620b66d1104a31b9baff8612c0dac5b80a826f2b3490b12d03d1a694895261', '[\"*\"]', NULL, NULL, '2023-02-28 02:36:06', '2023-02-28 02:36:06'),
(139, 'App\\Models\\User', 1, 'ResetAPI', '8e18b6dec6a5218ad28a6e6d77122a282910e68746f80d9b917e915e83d14f1f', '[\"*\"]', NULL, NULL, '2023-02-28 02:36:08', '2023-02-28 02:36:08'),
(140, 'App\\Models\\User', 1, 'ResetAPI', 'eae2be9aedbb5ef47425503b3ba733b433bfc9e2b37955cb715e04d4514e16b6', '[\"*\"]', NULL, NULL, '2023-02-28 02:36:48', '2023-02-28 02:36:48'),
(141, 'App\\Models\\User', 1, 'ResetAPI', 'f8bae3b558fbf91d721a7522044e016276b050e2da9a1e5c9c70829f4099038e', '[\"*\"]', NULL, NULL, '2023-02-28 02:37:36', '2023-02-28 02:37:36'),
(142, 'App\\Models\\User', 1, 'ResetAPI', '846f388687393d85ed88793b6cc5e6b7f197b1b03693bb318b9d7fb015100ebe', '[\"*\"]', NULL, NULL, '2023-02-28 02:38:07', '2023-02-28 02:38:07'),
(143, 'App\\Models\\User', 1, 'ResetAPI', '00e89b29c76837cbd40c2b3055c35ada25616e05882e7f056a02d4f13c9861b0', '[\"*\"]', NULL, NULL, '2023-02-28 02:39:04', '2023-02-28 02:39:04'),
(144, 'App\\Models\\User', 1, 'ResetAPI', '1ca6771b2b7759b4f3821c718ce6b95f16bde7cf9b754938c2b76c37ce60ff66', '[\"*\"]', NULL, NULL, '2023-02-28 02:39:06', '2023-02-28 02:39:06'),
(145, 'App\\Models\\User', 1, 'ResetAPI', '89b77f02cc9d91b6d6069ee9bf5a52797df7d591272a599c575dda73a761d8bd', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:18', '2023-02-28 02:43:18'),
(146, 'App\\Models\\User', 1, 'ResetAPI', '14487f20b0c8de1a9058d9557acc5f727f5fe5ddc68520947370003589675660', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:19', '2023-02-28 02:43:19'),
(147, 'App\\Models\\User', 1, 'ResetAPI', '42957876462869be4724ae2ca78a31b2f87ebf00f1f37812ee331f96e1917fcd', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:41', '2023-02-28 02:43:41'),
(148, 'App\\Models\\User', 1, 'ResetAPI', '2253c3fb89a7230d2d046b3465db339610ee75a1f2e8727b4418c18a23866a33', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:44', '2023-02-28 02:43:44'),
(149, 'App\\Models\\User', 1, 'ResetAPI', '99e069bf9b4ae43da2fda3542e9f139b73c18370ff8f3385730f6957b3a40ed5', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:45', '2023-02-28 02:43:45'),
(150, 'App\\Models\\User', 1, 'ResetAPI', 'ac0cfa8672a073c1ebb997d05968f8dec41ca66040287862d133ac2856190d8a', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:49', '2023-02-28 02:43:49'),
(151, 'App\\Models\\User', 1, 'ResetAPI', 'f5a08b6a9bfd6a5b3f6193bdd0c4a635b1931fcc2397958a945c63efeae784fa', '[\"*\"]', NULL, NULL, '2023-02-28 02:43:53', '2023-02-28 02:43:53'),
(152, 'App\\Models\\User', 1, 'ResetAPI', '4d0707029356039759fb877748f72d7b81324bdbb23907db0d324ae844b2643c', '[\"*\"]', NULL, NULL, '2023-02-28 02:47:34', '2023-02-28 02:47:34'),
(153, 'App\\Models\\User', 1, 'ResetAPI', '9afb14984f8f074332133321eb608b7a23f3c85bff9e593b8333bc40c4802481', '[\"*\"]', NULL, NULL, '2023-02-28 02:47:35', '2023-02-28 02:47:35'),
(154, 'App\\Models\\User', 1, 'ResetAPI', 'f9934d8090d1004fcaa37a4d614a1ea45be9ea76a0bdd526abfe8bb43727d72b', '[\"*\"]', NULL, NULL, '2023-02-28 02:47:46', '2023-02-28 02:47:46'),
(155, 'App\\Models\\User', 1, 'ResetAPI', '82b7a746a1a7bba635b6847659f8faacba747fdaac6bde34f9a5f18fb7671321', '[\"*\"]', NULL, NULL, '2023-02-28 02:50:39', '2023-02-28 02:50:39'),
(156, 'App\\Models\\User', 1, 'ResetAPI', 'ac482ae7216e3bde0f08d674293a0432d8709cf2e681ff682e9dc02cd0e4abcf', '[\"*\"]', NULL, NULL, '2023-02-28 02:50:42', '2023-02-28 02:50:42'),
(157, 'App\\Models\\User', 1, 'ResetAPI', '49a92f8e8d1bc31d1115718e26067fb142f5378729c793f968f5db32083e4c65', '[\"*\"]', NULL, NULL, '2023-02-28 02:53:02', '2023-02-28 02:53:02'),
(158, 'App\\Models\\User', 1, 'ResetAPI', '5f6e37b515d4b2023d8bc0fffce27d9371066b2898cfc687787a99b590933064', '[\"*\"]', NULL, NULL, '2023-02-28 02:53:12', '2023-02-28 02:53:12'),
(159, 'App\\Models\\User', 1, 'ResetAPI', '1a1d704012b34e6dae5f50cb0032243db485db83409bf0bd6702b737b3fba99b', '[\"*\"]', NULL, NULL, '2023-02-28 02:53:48', '2023-02-28 02:53:48'),
(160, 'App\\Models\\User', 1, 'ResetAPI', '2be3e8d2e4159a0dec2636fe22a6f903c5610a94d3550dc7fe3e80050f3de84f', '[\"*\"]', NULL, NULL, '2023-02-28 02:54:50', '2023-02-28 02:54:50'),
(161, 'App\\Models\\User', 1, 'ResetAPI', '6a1b5c94f2943ba63590dff84951c6a70d45e6c10e55c003dc60e08ef72a1ed3', '[\"*\"]', NULL, NULL, '2023-02-28 02:55:28', '2023-02-28 02:55:28'),
(162, 'App\\Models\\User', 1, 'ResetAPI', 'c5f1bab8cdac1544b7bb0a11729ef694b25984ed02e6d44de22fd1d27e9d75db', '[\"*\"]', NULL, NULL, '2023-02-28 02:55:28', '2023-02-28 02:55:28'),
(163, 'App\\Models\\User', 1, 'ResetAPI', 'a151a44be078a8be2c6ab1757b9ca3fc24763f732d83592ecfa22c7daa5be4d2', '[\"*\"]', NULL, NULL, '2023-02-28 02:56:23', '2023-02-28 02:56:23'),
(164, 'App\\Models\\User', 1, 'ResetAPI', '53df1f7621e29cc5149d549e78f7e11b4d5d81413d4d7144ffc7b83f81af126d', '[\"*\"]', NULL, NULL, '2023-02-28 02:56:24', '2023-02-28 02:56:24'),
(165, 'App\\Models\\User', 1, 'ResetAPI', '745626211c899e4686fd6ce459ff58fe6fccbe4778ad030657c705958b7a1fe4', '[\"*\"]', NULL, NULL, '2023-02-28 02:56:44', '2023-02-28 02:56:44'),
(166, 'App\\Models\\User', 1, 'ResetAPI', '66fe01501f75666481b6f8c9e9d7266fb47fb5057e79fcc618dd2cf3efd863b5', '[\"*\"]', NULL, NULL, '2023-02-28 02:57:57', '2023-02-28 02:57:57'),
(167, 'App\\Models\\User', 1, 'ResetAPI', '658820292b3c397b10a63e937de55af87968d4ea4ef39f9626b71e82fddf06bb', '[\"*\"]', NULL, NULL, '2023-02-28 02:58:09', '2023-02-28 02:58:09'),
(168, 'App\\Models\\User', 1, 'ResetAPI', '210e290f6d586802ff0d53bc964d1911676170fc2a0adbad7286cc4e1a84573f', '[\"*\"]', NULL, NULL, '2023-02-28 04:11:26', '2023-02-28 04:11:26'),
(169, 'App\\Models\\User', 1, 'ResetAPI', '8284a0099a6be91e083996c3fbe84a1ff41d890e2add2f2bc114f934e3610462', '[\"*\"]', NULL, NULL, '2023-02-28 04:13:25', '2023-02-28 04:13:25'),
(170, 'App\\Models\\User', 1, 'ResetAPI', '8958a20c6a42d40e8ed19299ac0bf9846a3d79bb67f322df194d3d5d3187022d', '[\"*\"]', NULL, NULL, '2023-02-28 04:14:29', '2023-02-28 04:14:29'),
(171, 'App\\Models\\User', 1, 'ResetAPI', '44c31dbcbddb1aa585e05a926318fa057fdffbcb3e5d3a571d8e27968f330cf4', '[\"*\"]', '2023-02-28 04:23:18', NULL, '2023-02-28 04:22:00', '2023-02-28 04:23:18'),
(172, 'App\\Models\\User', 1, 'ResetAPI', 'c9372820fe786b07ad609df10f5497d635b85fa10807899110ef5583c6459464', '[\"*\"]', NULL, NULL, '2023-02-28 04:27:23', '2023-02-28 04:27:23'),
(173, 'App\\Models\\User', 1, 'ResetAPI', '68373c031cb6eb7f1354588fd15ddb84c8e4d4976ab3f31d10949e7ad7585c20', '[\"*\"]', NULL, NULL, '2023-02-28 04:29:35', '2023-02-28 04:29:35'),
(174, 'App\\Models\\User', 1, 'ResetAPI', '56f008b3007c90dc876acf5eab0792c15590f0f277e7850d5b21a89972e96124', '[\"*\"]', NULL, NULL, '2023-02-28 04:56:01', '2023-02-28 04:56:01'),
(175, 'App\\Models\\User', 1, 'ResetAPI', '06708a8cee26dccf74543ec8960b5d2cc148d082a62cf351278579800c2532e3', '[\"*\"]', NULL, NULL, '2023-02-28 04:56:05', '2023-02-28 04:56:05'),
(197, 'App\\Models\\User', 1, 'API_UserID_1', 'bdcac27f4cc7fad051782165493b406d94027a3a2ac0456228fca0d0d784eb22', '[\"*\"]', NULL, NULL, '2023-02-28 07:02:23', '2023-02-28 07:02:23'),
(198, 'App\\Models\\User', 21, 'API_UserID_21', '0bd0c5a8b7c51a0cc32e21d0b25340820a26370cf589a66c0f8e6967c3539832', '[\"*\"]', '2023-02-28 07:07:16', NULL, '2023-02-28 07:02:39', '2023-02-28 07:07:16'),
(199, 'App\\Models\\User', 1, 'API_UserID_1', 'c11925f70aa2bd97d62a112757f04f57871419a76e2c191e1f209f471124b894', '[\"*\"]', '2023-02-28 07:08:14', NULL, '2023-02-28 07:07:43', '2023-02-28 07:08:14'),
(200, 'App\\Models\\User', 1, 'API_UserID_1', 'ac3367ac877a52993fad8b2d75f43a4285f19feed79af8f1f4884dd1a8006446', '[\"*\"]', '2023-02-28 07:17:50', NULL, '2023-02-28 07:17:25', '2023-02-28 07:17:50'),
(201, 'App\\Models\\User', 21, 'API_UserID_21', '70dd63fc9cd8fa101a356f6265180a46e652fb662760bb8665a399f6632c274e', '[\"*\"]', NULL, NULL, '2023-02-28 07:19:59', '2023-02-28 07:19:59'),
(202, 'App\\Models\\User', 21, 'API_UserID_21', '023129ccd6ae52ed09fafd074799efde481d3404bfd17552c45512de8c50e0f5', '[\"*\"]', '2023-02-28 07:23:52', NULL, '2023-02-28 07:20:16', '2023-02-28 07:23:52'),
(203, 'App\\Models\\User', 1, 'API_UserID_1', '87e1b866e19f21f8f9f00dc791b630b7989d50730940e4f8e726392fb6f7ce2c', '[\"*\"]', '2023-02-28 07:25:39', NULL, '2023-02-28 07:25:19', '2023-02-28 07:25:39'),
(204, 'App\\Models\\User', 1, 'API_UserID_1', '23f2075644ee938f7305869b70d897ae542903ea929a1e4fb84fe1a67910657a', '[\"super_user\"]', NULL, NULL, '2023-02-28 07:31:26', '2023-02-28 07:31:26'),
(205, 'App\\Models\\User', 21, 'API_UserID_21', 'f253ab45de05304c07295fdb2b3dbc6ecb7e5805ac39fc02e2efcb60c09a4dbe', '[\"super_user\"]', '2023-02-28 07:32:30', NULL, '2023-02-28 07:45:38', '2023-02-28 07:45:30'),
(206, 'App\\Models\\User', 1, 'API_UserID_1', '0df9e7ab693c5df41ce799aa5d1b8c9a4ac4dbfb0f5978a0e5778aa4165dbdcb', '[\"super_user\"]', '2023-02-28 07:52:37', NULL, '2023-02-28 07:41:23', '2023-02-28 07:52:37'),
(207, 'App\\Models\\User', 1, 'API_UserID_1', '5353aa29651870ecabf635cc1c4d5f4bdd90f1890ac153e5f643c8b0efadf7f1', '[\"super_user\"]', '2023-03-02 05:16:55', NULL, '2023-03-02 05:14:29', '2023-03-02 05:16:55'),
(208, 'App\\Models\\User', 21, 'API_UserID_21', '733633511237cea62fd00d7a31a4724151ef0564b8a83d4f5e54e4a17bef24e3', '[\"super_user\"]', '2023-03-02 05:18:20', NULL, '2023-03-02 05:17:34', '2023-03-02 05:18:20'),
(209, 'App\\Models\\User', 21, 'API_UserID_21', '838256b8105683e9729f0ad4c956ee631311a07b91ec23b9f0ee985ff7a47d22', '[\"super_user\"]', NULL, NULL, '2023-03-02 05:20:16', '2023-03-02 05:20:16'),
(210, 'App\\Models\\User', 1, 'API_UserID_1', 'cef55229cee448fa57c448665ddb4c3965aaac144ad4814ffb665d752864ca10', '[\"super_user\"]', '2023-03-02 05:25:35', NULL, '2023-03-02 05:21:01', '2023-03-02 05:25:35'),
(211, 'App\\Models\\User', 21, 'API_UserID_21', 'd7da5a50aaecb74dc35ffed3854b738f306fbe3c813ad8d5e098e5830bc21df0', '[\"super_user\"]', '2023-03-02 05:25:49', NULL, '2023-03-02 05:21:29', '2023-03-02 05:25:49');

-- --------------------------------------------------------

--
-- テーブルの構造 `reservations`
--

CREATE TABLE `reservations` (
  `id` bigint UNSIGNED NOT NULL,
  `domain_organization` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT '自治体ドメイン名',
  `mode_reserve` int NOT NULL DEFAULT '0' COMMENT 'アカウントフラグ（0:通常/1:常時）',
  `date_reservation` date NOT NULL COMMENT '予約日',
  `email_staff` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '職員メールアドレス',
  `text_remarks` text COLLATE utf8mb4_bin COMMENT '備考欄',
  `created_at` date NOT NULL COMMENT 'データ登録日',
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'データ更新日'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `reservations`
--

INSERT INTO `reservations` (`id`, `domain_organization`, `mode_reserve`, `date_reservation`, `email_staff`, `text_remarks`, `created_at`, `updated_at`) VALUES
(1, 'marumaru.co.jp', 0, '2023-01-24', 'user@marumaru.co.jp', NULL, '2023-01-23', '2023-01-23 05:19:39'),
(2, 'marumaru.co.jp', 0, '2023-02-01', 'user@marumaru.co.jp', NULL, '2023-01-23', '2023-01-23 05:19:43'),
(19, 'marumaru.co.jp', 0, '2023-02-02', 'user@marumaru.co.jp', NULL, '2023-01-31', '2023-01-31 04:02:24'),
(20, 'marumaru.co.jp', 1, '2023-01-28', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 00:32:20'),
(21, 'marumaru.co.jp', 1, '2023-01-28', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 00:32:20'),
(37, 'marumaru.co.jp', 1, '2023-02-03', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 05:13:22'),
(38, 'marumaru.co.jp', 1, '2023-02-03', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 05:13:22'),
(106, 'marumaru.co.jp', 1, '2023-02-02', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:23'),
(107, 'marumaru.co.jp', 1, '2023-02-02', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:23'),
(109, 'marumaru.co.jp', 1, '2023-02-04', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:30'),
(110, 'marumaru.co.jp', 1, '2023-02-04', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:30'),
(112, 'marumaru.co.jp', 1, '2023-02-05', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:35'),
(113, 'marumaru.co.jp', 1, '2023-02-05', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:46:35'),
(115, 'marumaru.co.jp', 1, '2023-02-06', 'user2@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:48:15'),
(116, 'marumaru.co.jp', 1, '2023-02-06', 'user222@marumaru.co.jp', NULL, '2023-02-01', '2023-02-01 07:48:15'),
(118, 'marumaru.co.jp', 0, '2023-02-10', 'user@marumaru.co.jp', NULL, '2023-02-06', '2023-02-06 00:31:24'),
(119, 'marumaru.co.jp', 0, '2023-03-06', 'user@marumaru.co.jp', NULL, '2023-02-22', '2023-02-22 07:53:48'),
(120, 'marumaru.co.jp', 0, '2023-03-07', 'user@marumaru.co.jp', NULL, '2023-02-27', '2023-02-27 04:31:18'),
(121, 'marumaru.co.jp', 1, '2023-03-01', 'user2@marumaru.co.jp', NULL, '2023-02-28', '2023-02-28 04:23:17'),
(122, 'marumaru.co.jp', 1, '2023-03-01', 'user222@marumaru.co.jp', NULL, '2023-02-28', '2023-02-28 04:23:17'),
(133, 'marumaru.co.jp', 1, '2023-03-03', 'user2@marumaru.co.jp', NULL, '2023-03-02', '2023-03-02 05:25:49'),
(134, 'marumaru.co.jp', 1, '2023-03-03', 'user222@marumaru.co.jp', NULL, '2023-03-02', '2023-03-02 05:25:49'),
(135, 'marumaru.co.jp', 0, '2023-03-11', 'user@marumaru.co.jp', NULL, '2023-03-10', '2023-03-10 05:56:20');

-- --------------------------------------------------------

--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` bigint UNSIGNED NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '職員メールアドレス',
  `domain_organization` varchar(100) COLLATE utf8mb4_bin NOT NULL COMMENT '自治体ドメイン名',
  `mode_reserve` int NOT NULL DEFAULT '0' COMMENT 'アカウントフラグ（0:通常/1:常時）',
  `name` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT 'ユーザー名',
  `password` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT 'ログインパスワード',
  `mode_admin` tinyint NOT NULL COMMENT '管理者モード(0:一般/1:自治体/9:NESIC)',
  `flag_delete` int NOT NULL DEFAULT '0' COMMENT '削除フラグ（0:アクティブ/1:削除）',
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `remember_token` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `email`, `domain_organization`, `mode_reserve`, `name`, `password`, `mode_admin`, `flag_delete`, `email_verified_at`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'super@marumaru.co.jp', 'marumaru.co.jp', 0, 'superuser', '$2y$10$ZcChPhSTI3/sohvBSmRpwur2832ogipYkGYlXRN7nA/gZNsZer3ge', 9, 0, NULL, 'cSsMocpnAVge4X4dzdNhKxJEI6JxhqmRgylBTsbf7NdmTKyyl6sGq1RV0vd5', NULL, '2023-03-02 05:21:01'),
(2, 'admin@marumaru.co.jp', 'marumaru.co.jp', 0, 'admin', '$2y$10$MFYh49lAyRMn7uqLSXcwaO4SPbLoJiYh1MREGr6wFGTRgrA6ziRGW', 1, 0, NULL, NULL, NULL, NULL),
(3, 'user@marumaru.co.jp', 'marumaru.co.jp', 0, 'user', '$2y$10$6VXtD9me1dQTLPi/T.CoROqEgGFwKOGlZYJ3sIHxvwPiX1aVAKA4S', 0, 0, NULL, NULL, NULL, NULL),
(4, 'super@test1.co.jp', 'test1.co.jp', 0, 'superuser', '$2y$10$FaC5C7tKLqTW.hAGTrH7k.da9x03E3bjA8J8MahGT2orGshvhwG2i', 9, 0, NULL, NULL, NULL, NULL),
(5, 'admin@test1.co.jp', 'test1.co.jp', 0, 'admin', '$2y$10$q3beiCrYRU7EP4sL2dO8aOubqA14/VQQsYZ/fXl2wP2PtnBgy5htm', 1, 0, NULL, NULL, NULL, NULL),
(6, 'user@test1.co.jp', 'test1.co.jp', 0, 'user', '$2y$10$4Y9ojZj1I8d/EweVoLtIjOLTT3mDaFrsaJC0dNcd2c3zB4f8PffVG', 0, 0, NULL, NULL, NULL, NULL),
(19, 'user2@marumaru.co.jp', 'marumaru.co.jp', 1, 'user2', '$2y$10$6VXtD9me1dQTLPi/T.CoROqEgGFwKOGlZYJ3sIHxvwPiX1aVAKA4S', 0, 0, NULL, NULL, NULL, NULL),
(20, 'user222@marumaru.co.jp', 'marumaru.co.jp', 1, 'user222', '$2y$10$6VXtD9me1dQTLPi/T.CoROqEgGFwKOGlZYJ3sIHxvwPiX1aVAKA4S', 0, 0, NULL, NULL, NULL, NULL),
(21, 'super2@marumaru.co.jp', 'marumaru.co.jp', 0, 'superuser2', '$2y$10$ZcChPhSTI3/sohvBSmRpwur2832ogipYkGYlXRN7nA/gZNsZer3ge', 9, 0, NULL, 'sjWjOb2LVzMWF4PoPOtNROzZBHv3q8StwZZNaTcp', NULL, '2023-03-02 05:21:29'),
(22, 'test1@marumaru.co.jp', 'marumaru.co.jp', 1, '鈴木一郎', '$2y$10$RT8C2kCLD.3IoiicpuHPfugotzbwnEg86EPLl/XxacO0zKf8h0Nue', 0, 0, NULL, NULL, '2023-03-15 03:51:12', '2023-03-15 03:51:12'),
(23, 'test2@marumaru.co.jp', 'marumaru.co.jp', 1, '山田二郎', '$2y$10$c4VIkf.6j5deKxrz1DJU1u8pKBwWLtpMwWG.ZfHRA.gOrMSNoy9E6', 0, 0, NULL, NULL, '2023-03-15 03:51:12', '2023-03-15 03:51:12'),
(24, 'test3@marumaru.co.jp', 'marumaru.co.jp', 1, '佐藤三郎', '$2y$10$f5WS1RFZRXrT7HEh/vNf8.JMrWKbxvjmgtf3uakdduSsOwqsqL8nC', 0, 0, NULL, NULL, '2023-03-15 03:51:12', '2023-03-15 03:51:12'),
(25, 'test4@marumaru.co.jp', 'marumaru.co.jp', 1, '伊藤四郎', '$2y$10$M1.AEBWuUcFQBZqsXxGNnOPBfcqKRjTIdrCnGViTVl1VgyokXHBxC', 0, 0, NULL, NULL, '2023-03-15 03:51:12', '2023-03-15 03:51:12'),
(26, 'test5@marumaru.co.jp', 'marumaru.co.jp', 1, '加藤五郎', '$2y$10$X3ARKS6jL1TjmVuLxVp1X.Prc7wMkQfzfW2..qHG05C2HDq3.eabe', 0, 0, NULL, NULL, '2023-03-15 03:51:13', '2023-03-15 03:51:13');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `auth_histories`
--
ALTER TABLE `auth_histories`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- テーブルのインデックス `holidays`
--
ALTER TABLE `holidays`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `organizations`
--
ALTER TABLE `organizations`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `organizations_domain_organization_mode_reserve_unique` (`domain_organization`,`mode_reserve`);

--
-- テーブルのインデックス `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- テーブルのインデックス `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- テーブルのインデックス `reservations`
--
ALTER TABLE `reservations`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `reservations_table_unique_keys` (`domain_organization`,`mode_reserve`,`date_reservation`,`email_staff`);

--
-- テーブルのインデックス `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `auth_histories`
--
ALTER TABLE `auth_histories`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- テーブルの AUTO_INCREMENT `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- テーブルの AUTO_INCREMENT `holidays`
--
ALTER TABLE `holidays`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=182;

--
-- テーブルの AUTO_INCREMENT `log`
--
ALTER TABLE `log`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- テーブルの AUTO_INCREMENT `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- テーブルの AUTO_INCREMENT `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- テーブルの AUTO_INCREMENT `organizations`
--
ALTER TABLE `organizations`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- テーブルの AUTO_INCREMENT `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=212;

--
-- テーブルの AUTO_INCREMENT `reservations`
--
ALTER TABLE `reservations`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=136;

--
-- テーブルの AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
